/*
 Задача с собакой и друзьями:
Два друга движутся навстречу с заданной скоростью. 
Скорость первого — 1 м/с 
второго —2 м/с. 
У них есть собака, которая бегает со скоростью 5 м/с. 
Когда друзья начинают свой путь, собака бежит от одного друга к другому, добегает, разворачивается и тут же бежит обратно.

Сколько раз собака перебежит от одного друга к другому, пока они не встретятся?

S — расстояние

V — скорость

T — время

V = S ÷ T

S = V × T

T = S ÷ V

*/

int frend
int firstFriednSpeed
int secondFriendSpeed